ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syslib/cy_syslib.c
/***************************************************************************//**
* \file cy_syslib.c
* \version 1.0
*
*  Description:
*   Provides system API implementation for the Cypress PDL 3.0 syslib driver.
*
********************************************************************************
* Copyright 2016, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_syslib.h"
#include "ipc/cy_ipc_drv.h"

/* Flash wait states (LP mode at 1.1v) */
#define CY_SYSLIB_FLASH_LP_WS_0_FREQ_MAX    ( 24UL)
#define CY_SYSLIB_FLASH_LP_WS_1_FREQ_MAX    ( 48UL)
#define CY_SYSLIB_FLASH_LP_WS_2_FREQ_MAX    ( 72UL)
#define CY_SYSLIB_FLASH_LP_WS_3_FREQ_MAX    ( 96UL)
#define CY_SYSLIB_FLASH_LP_WS_4_FREQ_MAX    (120UL)

/* Flash wait states (ULP mode at 0.9v) */
#define CY_SYSLIB_FLASH_ULP_WS_0_FREQ_MAX    ( 16UL)
#define CY_SYSLIB_FLASH_ULP_WS_1_FREQ_MAX    ( 33UL)
#define CY_SYSLIB_FLASH_ULP_WS_2_FREQ_MAX    ( 50UL)

/* ROM wait states for the slow clock domain (LP mode at 1.1v) */
#define CY_SYSLIB_ROM_LP_SLOW_WS_0_FREQ_MAX  (100UL)
#define CY_SYSLIB_ROM_LP_SLOW_WS_1_FREQ_MAX  (120UL)

/* ROM wait states for the slow clock domain (ULP mode at 0.9v) */
#define CY_SYSLIB_ROM_ULP_SLOW_WS_0_FREQ_MAX ( 25UL)
#define CY_SYSLIB_ROM_ULP_SLOW_WS_1_FREQ_MAX ( 50UL)

/* ROM wait states for the fast clock domain (LP mode at 1.1v) */
#define CY_SYSLIB_ROM_LP_FAST_WS_0_FREQ_MAX  (120UL)

/* ROM wait states for the slow clock domain (ULP mode at 0.9v) */
#define CY_SYSLIB_ROM_ULP_FAST_WS_0_FREQ_MAX ( 50UL)

/* SRAM wait states for the slow clock domain (LP mode at 1.1v) */
#define CY_SYSLIB_RAM_LP_SLOW_WS_0_FREQ_MAX  (100UL)
#define CY_SYSLIB_RAM_LP_SLOW_WS_1_FREQ_MAX  (120UL)

/* SRAM wait states for the slow clock domain (ULP mode at 0.9v) */
#define CY_SYSLIB_RAM_ULP_SLOW_WS_0_FREQ_MAX ( 25UL)
#define CY_SYSLIB_RAM_ULP_SLOW_WS_1_FREQ_MAX ( 50UL)

/* SRAM wait states for the fast clock domain (LP mode at 1.1v) */
#define CY_SYSLIB_RAM_LP_FAST_WS_0_FREQ_MAX  (120UL)

/* SRAM wait states for the fast clock domain (ULP mode at 0.9v) */
#define CY_SYSLIB_RAM_ULP_FAST_WS_0_FREQ_MAX ( 50UL)


#if !defined(NDEBUG)
    char_t cy_assertFileName[CY_MAX_FILE_NAME_SIZE];
    uint32_t cy_assertLine;
#endif /* NDEBUG */

#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED)
    cy_stc_fault_frame_t cy_faultFrame;
#endif /* (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) */


static void Cy_SysLib_SetWaitStates_ULP(uint32_t clkHfMHz);
static void Cy_SysLib_SetWaitStates_LP(uint32_t clkHfMHz);


/*******************************************************************************
* Function Name: Cy_SysLib_Delay
****************************************************************************//**
*
* The function delays by the specified number of milliseconds.
* By default, the number of cycles to delay is calculated based on the
* SystemCoreClock.
* If the parameter is bigger than CY_DELAY_MS_OVERFLOW(32kHz delay), run an
* additional loop to prevent an overflow.
*
*  \param milliseconds  The number of milliseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_Delay(uint32_t milliseconds)
{
    while (milliseconds > CY_DELAY_MS_OVERFLOW)
    {
        /* This loop prevents overflow.
         * At 100MHz, milliseconds * cy_delayFreqKhz it overflows at about 42 seconds
         */
        Cy_SysLib_DelayCycles(cy_delay32kMs);
        milliseconds -= CY_DELAY_MS_OVERFLOW;
    }

    Cy_SysLib_DelayCycles(milliseconds * cy_delayFreqKhz);
}


/*******************************************************************************
* Function Name: Cy_SysLib_DelayUs
****************************************************************************//**
*
* The function delays by the specified number of microseconds.
* By default, the number of cycles to delay is calculated based on the
* SystemCoreClock.
*
*  \param microseconds  The number of microseconds to delay.
*
*******************************************************************************/
void Cy_SysLib_DelayUs(uint16_t microseconds)
{
    Cy_SysLib_DelayCycles((uint32_t) microseconds * cy_delayFreqMhz);
}


/*******************************************************************************
* Function Name: Cy_SysLib_Halt
****************************************************************************//**
*
*  This function halts the CPU but only the CPU which calls the function.
*  It doesn't affect other CPUs.
*
*  \param reason  The value to be used during debugging.
*
*  \note The function executes the BKPT instruction for halting CPU and is
*        intended to be used for debug purposes. A regular use case requires
*        Debugger attachment before the function call.
*        The BKPT instruction causes the CPU to enter the Debug state. Debug
*        tools can use this to investigate the system state, when the
*        instruction at a particular address is reached.
*
*  \note Execution of a BKPT instruction without a debugger attached produces
*        a fault. The fault results in the HardFault exception being taken
*        or causes Lockup state if it occurs in the NMI or HardFault handler.
*        The default HardFault handler make a software reset if the build option
*        is release mode (NDEBUG). If the build option is debug mode, the system
*        will stay in the infinite loop of the Cy_SysLib_ProcessingFault()
*        function.
*
*******************************************************************************/
__NO_RETURN void Cy_SysLib_Halt(uint32_t reason)
{
    if(0u != reason)
    {
        /* To remove an unreferenced local variable warning */
    }

    #if defined (__ARMCC_VERSION)
        __breakpoint(0x0);
        while(1u) {}
    #elif defined(__GNUC__)
        __asm("    bkpt    1");
        __builtin_unreachable();
    #elif defined (__ICCARM__)
        __asm("    bkpt    1");
    #else
        #error "Unsupported toolchain"
    #endif  /* (__ARMCC_VERSION) */
}


