ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syslib/cy_syslib.c
/*******************************************************************************
* Function Name: Cy_SysLib_ClearFlashCacheAndBuffer
****************************************************************************//**
*
*  This function invalidates the flash cache and buffer. It ensures the valid
*  data is read from flash instead of using outdated data from the cache.
*  The caches' LRU structure is also reset to their default state.
*
*  \note The operation takes a maximum of three clock cycles on the slowest of
*        the clk_slow and clk_fast clocks.
*
*******************************************************************************/
void Cy_SysLib_ClearFlashCacheAndBuffer(void)
{
    FLASHC->FLASH_CMD = FLASHC_FLASH_CMD_INV_Msk;
}


/*******************************************************************************
* Function Name: Cy_SysLib_GetResetReason
****************************************************************************//**
*
*  The function returns the cause for the latest reset(s) that occurred in
*  the system. The reset causes in the registers are two separated parts which
*  are HFCLK error and system faults.
*  The return results are consolidated reset causes for both parts by
*  reading both RES_CAUSE and RES_CAUSE2 registers.
*
*  \return The cause of a system reset.
*
*  | Name                          | Value
*  |-------------------------------|---------------------
*  | CY_SYSLIB_RESET_HWWDT         | 0x00001 (bit0)
*  | CY_SYSLIB_RESET_ACT_FAULT     | 0x00002 (bit1)
*  | CY_SYSLIB_RESET_DPSLP_FAULT   | 0x00004 (bit2)
*  | CY_SYSLIB_RESET_CSV_WCO_LOSS  | 0x00008 (bit3)
*  | CY_SYSLIB_RESET_SOFT          | 0x00010 (bit4)
*  | CY_SYSLIB_RESET_SWWDT0        | 0x00020 (bit5)
*  | CY_SYSLIB_RESET_SWWDT1        | 0x00040 (bit6)
*  | CY_SYSLIB_RESET_SWWDT2        | 0x00080 (bit7)
*  | CY_SYSLIB_RESET_SWWDT3        | 0x00100 (bit8)
*  | CY_SYSLIB_RESET_HFCLK_LOSS    | 0x10000 (bit16)
*  | CY_SYSLIB_RESET_HFCLK_ERR     | 0x20000 (bit17)
*
*******************************************************************************/
uint32_t Cy_SysLib_GetResetReason(void)
{
    uint32_t retVal;

    retVal = SRSS->RES_CAUSE |
             ((CY_LO16(SRSS->RES_CAUSE2) > 0u) ? CY_SYSLIB_RESET_HFCLK_LOSS : 0u) |
             ((CY_HI16(SRSS->RES_CAUSE2) > 0u) ? CY_SYSLIB_RESET_HFCLK_ERR : 0u);

    return (retVal);
}


/*******************************************************************************
* Function Name: Cy_SysLib_GetNumHfclkResetCause
****************************************************************************//**
*
* This function returns the number of HF_CLK which is a reset cause (RES_CAUSE2)
* by a loss or an error of the high frequency clock.
*
* The Clock supervisors (CSV) can make a reset as CSV_FREQ_ACTION setting
* when a CSV frequency anomaly is detected. The function returns the index
* of HF_CLK, if a reset occurred due to an anomaly HF_CLK. There are two
* different options for monitoring on HF_CLK which are a frequency loss
* and a frequency error.
*
* \return
*   - The number HF_CLK from Clock Supervisor High Frequency Loss:  Bits[15:0]
*   - The number HF_CLK from Clock Supervisor High Frequency error: Bits[31:16]
*
*******************************************************************************/
uint32_t Cy_SysLib_GetNumHfclkResetCause(void)
{
    return (SRSS->RES_CAUSE2);
}


/*******************************************************************************
* Function Name: Cy_SysLib_ClearResetReason
****************************************************************************//**
*
*  This function clears the values of RES_CAUSE and RES_CAUSE2.
*
*******************************************************************************/
void Cy_SysLib_ClearResetReason(void)
{
    SRSS->RES_CAUSE  = SRSS->RES_CAUSE;
    SRSS->RES_CAUSE2 = SRSS->RES_CAUSE2;
}


#if (CY_CPU_CORTEX_M0P) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysLib_SoftResetCM4
****************************************************************************//**
*
*  This function performs a CM4 Core software reset using the CM4_PWR_CTL
*  register.
*
*  \note This function should be called only when the CM4 core is in Deep
*        Sleep mode.
*  \note This function will not reset CM0+ Core.
*
*******************************************************************************/
void Cy_SysLib_SoftResetCM4(void)
{
    volatile uint32_t msg = CY_IPC_DATA_FOR_CM4_SOFT_RESET;

    /* Tries to acquire the IPC structure and pass the arguments to SROM API.
    *  SROM API parameters:
    *   ipcPtr: IPC_STRUCT0 - IPC Structure 0 reserved for M0+ Secure Access.
    *   notifyEvent_Intr: 1u - IPC Interrupt Structure 1 is used for Releasing IPC 0 (M0+ NMI Handler).
    *   msgPtr: &msg - The address of SRAM with the API's parameters.
    */
    if(CY_IPC_DRV_SUCCESS != Cy_IPC_DRV_SendMsgPtr(IPC_STRUCT0, 1u, (void *) &msg))
    {
        CY_ASSERT(0u != 0u);
    }
}
#endif /* CY_CPU_CORTEX_M0P || defined(CY_DOXYGEN) */


/*******************************************************************************
* Function Name: Cy_SysLib_GetUniqueId
****************************************************************************//**
*
* This function returns the silicon unique ID.
* The ID includes Die lot[3]#, Die Wafer#, Die X, Die Y, DIE Sort# and
* Die Minor#
*
* \return
* A combined 64-bit unique ID.
* [63:56] - DIE_MINOR
* [55:48] - DIE_SORT
* [47:40] - DIE_Y
* [39:32] - DIE_X
* [31:24] - DIE_WAFER
* [23:16] - DIE_LOT[2]
* [15: 8] - DIE_LOT[1]
* [ 7: 0] - DIE_LOT[0]
*
*******************************************************************************/
uint64_t Cy_SysLib_GetUniqueId(void)
{
    uint64_t uniqueId;

    uniqueId = ((uint64_t)SFLASH->DIE_MINOR   << CY_UNIQUE_ID_DIE_MINOR_Pos) |
               ((uint64_t)SFLASH->DIE_SORT    << CY_UNIQUE_ID_DIE_SORT_Pos)  |
               ((uint64_t)SFLASH->DIE_Y       << CY_UNIQUE_ID_DIE_Y_Pos)     |
               ((uint64_t)SFLASH->DIE_X       << CY_UNIQUE_ID_DIE_X_Pos)     |
               ((uint64_t)SFLASH->DIE_WAFER   << CY_UNIQUE_ID_DIE_WAFER_Pos) |
               ((uint64_t)SFLASH->DIE_LOT[2u] << CY_UNIQUE_ID_DIE_LOT_2_Pos) |
               ((uint64_t)SFLASH->DIE_LOT[1u] << CY_UNIQUE_ID_DIE_LOT_1_Pos) |
               ((uint64_t)SFLASH->DIE_LOT[0u] << CY_UNIQUE_ID_DIE_LOT_0_Pos);

    return (uniqueId);
}


#if (CY_ARM_FAULT_DEBUG == CY_ARM_FAULT_DEBUG_ENABLED) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysLib_FaultHandler
****************************************************************************//**
*
* This function stores the ARM Cortex registers into a non-zero init area for
* debugging. This function calls Cy_SysLib_ProcessingFault() after storing all
* the information.
*
* \param faultStackAddr The address of the stack pointer, indicates the lowest
*                       address in the fault stack frame to be stored.
* \note This function stores the fault stack frame only for the first occurred
*       fault.
* \note This function sets two flags into the fault structure: one checks
*       which core cause fault, another checks the type of fault for CM4 core.
*       The flags should be cleared after analysis of the stored
*       register values, to have possibility to distinguish the next fault.
* \note The PDL doesn't provide an API which can analyse the stored register
*       values. A user has to add additional functions for the analysis,
*       if necessary.
* \note The CY_ARM_FAULT_DEBUG macro defines if the Fault Handler is enabled.
*       By default it is set to CY_ARM_FAULT_DEBUG_ENABLED and enables the
*       Fault Handler.
*       If there is a necessity to save memory or have some specific custom
*       handler, etc. then CY_ARM_FAULT_DEBUG should be redefined as
*       CY_ARM_FAULT_DEBUG_DISABLED. To do this the following definition should
*       be added to the compiler Command Line (through the project Build
*       Settings): "-D CY_ARM_FAULT_DEBUG=0".
*
*******************************************************************************/
void Cy_SysLib_FaultHandler(uint32_t const *faultStackAddr)
{
    #if (CY_CPU_CORTEX_M0P)
        if(CY_CM0P_FAULT_TYPE != cy_faultFrame.fault)
        {
            cy_faultFrame.fault = CY_CM0P_FAULT_TYPE;    /* CM0P fault occurred. */
    #elif (CY_CPU_CORTEX_M4)
        if(CY_CM4_FAULT_TYPE != cy_faultFrame.fault)
        {
            cy_faultFrame.fault = CY_CM4_FAULT_TYPE;     /* CM4 fault occurred. */
            /* Stores the Configurable Fault Status Register state with the fault cause */
            cy_faultFrame.cfsr = SCB->CFSR;
            cy_faultFrame.faultType = CY_NON_FPU_FAULT_TYPE;
    #endif /* CY_CPU_CORTEX_M0P */
            /* Stores general registers */
            cy_faultFrame.r0  = faultStackAddr[CY_R0_Pos];
            cy_faultFrame.r1  = faultStackAddr[CY_R1_Pos];
            cy_faultFrame.r2  = faultStackAddr[CY_R2_Pos];
            cy_faultFrame.r3  = faultStackAddr[CY_R3_Pos];
            cy_faultFrame.r12 = faultStackAddr[CY_R12_Pos];
            cy_faultFrame.lr  = faultStackAddr[CY_LR_Pos];
            cy_faultFrame.pc  = faultStackAddr[CY_PC_Pos];
            cy_faultFrame.psr = faultStackAddr[CY_PSR_Pos];

            #if (CY_CPU_CORTEX_M4) && ((defined (__FPU_PRESENT) && (__FPU_PRESENT == 1U)) && \
                                       (defined (__FPU_USED   ) && (__FPU_USED    == 1U)))
                /* Checks cumulative exception bits for floating-point exceptions */
                if(0U != (__get_FPSCR() & (CY_FPSCR_IXC_Msk | CY_FPSCR_IDC_Msk)))
                {
                    cy_faultFrame.faultType = CY_FPU_FAULT_TYPE;
                    cy_faultFrame.s0    = faultStackAddr[CY_S0_Pos];
                    cy_faultFrame.s1    = faultStackAddr[CY_S1_Pos];
                    cy_faultFrame.s2    = faultStackAddr[CY_S2_Pos];
                    cy_faultFrame.s3    = faultStackAddr[CY_S3_Pos];
                    cy_faultFrame.s4    = faultStackAddr[CY_S4_Pos];
                    cy_faultFrame.s5    = faultStackAddr[CY_S5_Pos];
                    cy_faultFrame.s6    = faultStackAddr[CY_S6_Pos];
                    cy_faultFrame.s7    = faultStackAddr[CY_S7_Pos];
                    cy_faultFrame.s8    = faultStackAddr[CY_S8_Pos];
                    cy_faultFrame.s9    = faultStackAddr[CY_S9_Pos];
                    cy_faultFrame.s10   = faultStackAddr[CY_S10_Pos];
                    cy_faultFrame.s11   = faultStackAddr[CY_S11_Pos];
                    cy_faultFrame.s12   = faultStackAddr[CY_S12_Pos];
                    cy_faultFrame.s13   = faultStackAddr[CY_S13_Pos];
                    cy_faultFrame.s14   = faultStackAddr[CY_S14_Pos];
                    cy_faultFrame.s15   = faultStackAddr[CY_S15_Pos];
                    cy_faultFrame.fpscr = faultStackAddr[CY_FPSCR_Pos];
                }
            #endif /* CY_CPU_CORTEX_M4 && __FPU_PRESENT */
        }

